# -*- coding: utf-8 -*-

TOKENIZE = {
    'SENTENCES': {
        'SENT1': {
            'INPUT': 'यह एक वाक्य है। यह एक दूसरा वाक्य है।',
            'OUTPUT': ['यह एक वाक्य है', 'यह एक दूसरा वाक्य है']
        }
    },
    'TOKENS': {
        'SENT1': {
            'INPUT': 'यह एक वाक्य है। यह एक दूसरा वाक्य है।',
            'OUTPUT': ['यह', 'एक', 'वाक्य', 'है','यह', 'एक', 'दूसरा', 'वाक्य', 'है']
        },
        'SENT2': {
            'INPUT': 'खाने में मिर्च-मसाले का सामंजस्य ठीक नही था।',
            'OUTPUT': ['खाने', 'में', 'मिर्च', 'मसाले','का', 'सामंजस्य', 'ठीक', 'नही', 'था']
        }
    },
    'STEM': {
        'WORD1': {
            'INPUT': 'सहायता',
            'OUTPUT': 'सहाय'
        }
    },
    'STOPWORDS': {
        'WORD1': 'उसे'
    }
}
