# -*- coding: utf-8 -*-

SUFFIXES = {
    1: [u"ो", u"े", u"ू", u"ु", u"ी", u"ि", u"ा"],
    2: [u"कर", u"ाओ", u"िए", u"ाई", u"ाए", u"ने", u"नी", u"ना", u"ते", u"ीं",
        u"ती", u"ता", u"ाँ", u"ां", u"ों", u"ें"],
    3: [u"ाकर", u"ाइए", u"ाईं", u"ाया", u"ेगी", u"ेगा", u"ोगी", u"ोगे",
        u"ाने", u"ाना", u"ाते", u"ाती", u"ाता", u"तीं", u"ाओं", u"ाएं",
        u"ुओं", u"ुएं", u"ुआं"],
    4: [u"ाएगी", u"ाएगा", u"ाओगी", u"ाओगे", u"एंगी", u"ेंगी", u"एंगे", u"ेंगे",
        u"ूंगी", u"ूंगा", u"ातीं", u"नाओं", u"नाएं", u"ताओं", u"ताएं", u"ियाँ",
        u"ियों", u"ियां"],
    5: [u"ाएंगी", u"ाएंगे", u"ाऊंगी", u"ाऊंगा", u"ाइयाँ", u"ाइयों", u"ाइयां"],
}

# list generated from http://mail.sarai.net/private/prc/Week-of-Mon-20080204/001656.html
# words are ordered by frequency of occurrence.

STOPWORDS = ['के', 'का', 'एक', 'में', 'की', 'है', 'यह', 'और', 'से', 'हैं',
             'को', 'पर', 'इस', 'होता', 'कि', 'जो', 'कर', 'मे', 'गया',
             'करने', 'किया', 'लिये', 'अपने', 'ने', 'बनी', 'नहीं', 'तो',
             'ही', 'या', 'एवं', 'दिया', 'हो', 'इसका', 'था', 'द्वारा',
             'हुआ', 'तक', 'साथ', 'करना', 'वाले', 'बाद', 'लिए', 'आप',
             'कुछ', 'सकते', 'किसी', 'ये', 'इसके', 'सबसे', 'इसमें', 'थे',
             'दो', 'होने', 'वह', 'वे', 'करते', 'बहुत', 'कहा', 'वर्ग', 'कई',
             'करें', 'होती', 'अपनी', 'उनके', 'थी', 'यदि', 'हुई', 'जा',
             'ना', 'इसे', 'कहते', 'जब', 'होते', 'कोई', 'हुए', 'व', 'न',
             'अभी', 'जैसे', 'सभी', 'करता', 'उनकी', 'तरह', 'उस', 'आदि',
             'कुल', 'एस', 'रहा', 'इसकी', 'सकता', 'रहे', 'उनका', 'इसी',
             'रखें', 'अपना', 'पे', 'उसके',]
